In [47]:
import pandas as pd
import numpy as np

In [48]:
df_calendar=pd.read_csv("Data/daily_calendar_with_events.csv")
df_prices = pd.read_csv("Data/item_prices.csv")
df_sales = pd.read_csv("Data/item_sales.csv")

In [49]:
df_calendar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1913 entries, 0 to 1912
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1913 non-null   object
 1   weekday      1913 non-null   object
 2   weekday_int  1913 non-null   int64
 3   d            1913 non-null   object
 4   event        26 non-null     object
dtypes: int64(1), object(4)
memory usage: 74.9+ KB

In [50]:
df_calendar['date']=pd.to_datetime(df_calendar['date'])

In [51]:
df_calendar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1913 entries, 0 to 1912
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1913 non-null   datetime64[ns]
 1   weekday      1913 non-null   object
 2   weekday_int  1913 non-null   int64
 3   d            1913 non-null   object
 4   event        26 non-null     object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 74.9+ KB

In [52]:
df_calendar['date']=pd.to_datetime(df_calendar['date'])

In [53]:
df_calendar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1913 entries, 0 to 1912
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1913 non-null   datetime64[ns]
 1   weekday      1913 non-null   object
 2   weekday_int  1913 non-null   int64
 3   d            1913 non-null   object
 4   event        26 non-null     object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 74.9+ KB

In [54]:
df_calendar['year']=df_calendar['date'].dt.year

In [55]:
df_calendar['month']=df_calendar['date'].dt.month

In [56]:
df_calendar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1913 entries, 0 to 1912
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1913 non-null   datetime64[ns]
 1   weekday      1913 non-null   object
 2   weekday_int  1913 non-null   int64
 3   d            1913 non-null   object
 4   event        26 non-null     object
 5   year         1913 non-null   int32
 6   month        1913 non-null   int32
dtypes: datetime64[ns](1), int32(2), int64(1), object(3)
memory usage: 89.8+ KB

In [57]:
df_calendar.head()

        date    weekday  weekday_int    d event  year  month
0 2011-01-29   Saturday            1  d_1   NaN  2011      1
1 2011-01-30     Sunday            2  d_2   NaN  2011      1
2 2011-01-31     Monday            3  d_3   NaN  2011      1
3 2011-02-01    Tuesday            4  d_4   NaN  2011      2
4 2011-02-02  Wednesday            5  d_5   NaN  2011      2

In [58]:
df_calendar.isnull().sum()

date              0
weekday           0
weekday_int       0
d                 0
event          1887
year              0
month             0
dtype: int64

In [59]:
df_calendar['event'].value_counts()

event
SuperBowl         6
Ramadan starts    5
Thanksgiving      5
NewYear           5
Easter            5
Name: count, dtype: int64

In [60]:
df_calendar['d'].value_counts()

d
d_1       1
d_1272    1
d_1284    1
d_1283    1
d_1282    1
         ..
d_635     1
d_634     1
d_633     1
d_632     1
d_1913    1
Name: count, Length: 1913, dtype: int64

In [61]:
df_calendar['d'].duplicated().sum()

0

In [62]:
df_calendar['week']=df_calendar['date'].dt.isocalendar().week

In [63]:
df_calendar.head()

        date    weekday  weekday_int    d event  year  month  week
0 2011-01-29   Saturday            1  d_1   NaN  2011      1     4
1 2011-01-30     Sunday            2  d_2   NaN  2011      1     4
2 2011-01-31     Monday            3  d_3   NaN  2011      1     5
3 2011-02-01    Tuesday            4  d_4   NaN  2011      2     5
4 2011-02-02  Wednesday            5  d_5   NaN  2011      2     5

In [64]:
df_calendar2=df_calendar.copy()

In [65]:
df_calendar2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1913 entries, 0 to 1912
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1913 non-null   datetime64[ns]
 1   weekday      1913 non-null   object
 2   weekday_int  1913 non-null   int64
 3   d            1913 non-null   object
 4   event        26 non-null     object
 5   year         1913 non-null   int32
 6   month        1913 non-null   int32
 7   week         1913 non-null   UInt32
dtypes: UInt32(1), datetime64[ns](1), int32(2), int64(1), object(3)
memory usage: 99.1+ KB

In [66]:
df_calendar2.head()

        date    weekday  weekday_int    d event  year  month  week
0 2011-01-29   Saturday            1  d_1   NaN  2011      1     4
1 2011-01-30     Sunday            2  d_2   NaN  2011      1     4
2 2011-01-31     Monday            3  d_3   NaN  2011      1     5
3 2011-02-01    Tuesday            4  d_4   NaN  2011      2     5
4 2011-02-02  Wednesday            5  d_5   NaN  2011      2     5

In [67]:
#Cambiamos la semana a entero, porque esta en float. 
df_calendar2['week']=df_calendar2['week'].astype(int)

#Acceder al valor de la comlumna 'week' en la fila 0 utilizando la etiqeuta del indice
valor_semana = df_calendar2.loc[0, 'week']
print(valor_semana)

4

In [68]:
df_calendar2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1913 entries, 0 to 1912
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1913 non-null   datetime64[ns]
 1   weekday      1913 non-null   object
 2   weekday_int  1913 non-null   int64
 3   d            1913 non-null   object
 4   event        26 non-null     object
 5   year         1913 non-null   int32
 6   month        1913 non-null   int32
 7   week         1913 non-null   int32
dtypes: datetime64[ns](1), int32(3), int64(1), object(3)
memory usage: 97.3+ KB

In [69]:
df_calendar2.head()

        date    weekday  weekday_int    d event  year  month  week
0 2011-01-29   Saturday            1  d_1   NaN  2011      1     4
1 2011-01-30     Sunday            2  d_2   NaN  2011      1     4
2 2011-01-31     Monday            3  d_3   NaN  2011      1     5
3 2011-02-01    Tuesday            4  d_4   NaN  2011      2     5
4 2011-02-02  Wednesday            5  d_5   NaN  2011      2     5

In [70]:
for i in range(len(df_calendar2)):
    if int(df_calendar2.loc[i, 'week'])<10:
        df_calendar2.loc[i, 'week']='0'+str(df_calendar2.loc[i, 'week'])

df_calendar2['week']=df_calendar2['week'].astype(str)

df_calendar2['yearweek']=df_calendar2['year'].astype(str)+df_calendar2['week']

df_calendar2['yearweek']=df_calendar2['yearweek'].astype(int)

df_calendar2.head()

C:\Users\gavelar\AppData\Local\Temp\ipykernel_21284\319858596.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '04' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  df_calendar2.loc[i, 'week']='0'+str(df_calendar2.loc[i, 'week'])

        date    weekday  weekday_int    d event  year  month week  yearweek
0 2011-01-29   Saturday            1  d_1   NaN  2011      1   04    201104
1 2011-01-30     Sunday            2  d_2   NaN  2011      1   04    201104
2 2011-01-31     Monday            3  d_3   NaN  2011      1   05    201105
3 2011-02-01    Tuesday            4  d_4   NaN  2011      2   05    201105
4 2011-02-02  Wednesday            5  d_5   NaN  2011      2   05    201105

In [71]:
df_calendar2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1913 entries, 0 to 1912
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1913 non-null   datetime64[ns]
 1   weekday      1913 non-null   object
 2   weekday_int  1913 non-null   int64
 3   d            1913 non-null   object
 4   event        26 non-null     object
 5   year         1913 non-null   int32
 6   month        1913 non-null   int32
 7   week         1913 non-null   object
 8   yearweek     1913 non-null   int32
dtypes: datetime64[ns](1), int32(3), int64(1), object(4)
memory usage: 112.2+ KB

In [72]:
#eliminamos columna d y la date

#Tabla Item_prices

In [76]:
df_prices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6965706 entries, 0 to 6965705
Data columns (total 5 columns):
 #   Column      Dtype
---  ------      -----
 0   item        object
 1   category    object
 2   store_code  object
 3   yearweek    float64
 4   sell_price  float64
dtypes: float64(2), object(3)
memory usage: 265.7+ MB

In [78]:
df_prices2=df_prices.copy()

In [ ]:
# Filtrar registrados donde 'yearweek'es nulo

In [80]:
registros_nulos = df_prices2.loc[df_prices2['yearweek'].isnull()]
registros_nulos.head()

                 item    category store_code  yearweek  sell_price
149  ACCESORIES_1_001  ACCESORIES      NYC_1       NaN     11.1454
150  ACCESORIES_1_001  ACCESORIES      NYC_1       NaN     11.1454
151  ACCESORIES_1_001  ACCESORIES      NYC_1       NaN     11.1454
152  ACCESORIES_1_001  ACCESORIES      NYC_1       NaN     11.1454
153  ACCESORIES_1_001  ACCESORIES      NYC_1       NaN     11.1454

In [ ]:
#Rellenamos los registros donde 'yearweek' es nulo

In [81]:
registros_nulos = df_prices2.loc[df_prices2['yearweek'].isnull()]
registros_nulos.head()

                 item    category store_code  yearweek  sell_price
149  ACCESORIES_1_001  ACCESORIES      NYC_1       NaN     11.1454
150  ACCESORIES_1_001  ACCESORIES      NYC_1       NaN     11.1454
151  ACCESORIES_1_001  ACCESORIES      NYC_1       NaN     11.1454
152  ACCESORIES_1_001  ACCESORIES      NYC_1       NaN     11.1454
153  ACCESORIES_1_001  ACCESORIES      NYC_1       NaN     11.1454

In [82]:
# Rellenamos los registros cuyo yearweek is null
df_prices2['yearweek'] = df_prices2['yearweek'].fillna(0).astype(int)

In [83]:
df_prices2['yearweek']=df_prices2['yearweek'].astype(int)

In [84]:
df_prices2.head()

               item    category store_code  yearweek  sell_price
0  ACCESORIES_1_001  ACCESORIES      NYC_1    201328     12.7414
1  ACCESORIES_1_001  ACCESORIES      NYC_1    201329     12.7414
2  ACCESORIES_1_001  ACCESORIES      NYC_1    201330     10.9858
3  ACCESORIES_1_001  ACCESORIES      NYC_1    201331     10.9858
4  ACCESORIES_1_001  ACCESORIES      NYC_1    201332     10.9858

In [ ]:
#Analizamos tabla Ventas

In [85]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30490 entries, 0 to 30489
Columns: 1920 entries, id to d_1913
dtypes: int64(1913), object(7)
memory usage: 446.6+ MB

In [86]:
df_sales.describe()

,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,d_9,d_10,...,d_1904,d_1905,d_1906,d_1907,d_1908,d_1909,d_1910,d_1911,d_1912,d_1913
count,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,...,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000
mean,1.070220,1.041292,0.780026,0.833454,0.627944,0.958052,0.918662,1.244080,1.073663,0.838701,...,1.370581,1.586159,1.693670,1.248245,1.232207,1.159167,1.149000,1.328862,1.605838,1.633158
std,5.126689,5.365468,3.667454,4.415141,3.379344,4.785947,5.059495,6.617729,5.917204,4.206199,...,3.740017,4.097191,4.359809,3.276925,3.125471,2.876026,2.950364,3.358012,4.089422,3.812248
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,1.000000,2.000000,2.000000,1.000000,1.000000,1.000000,1.000000,1.000000,2.000000,2.000000
max,360.000000,436.000000,207.000000,323.000000,296.000000,314.000000,316.000000,370.000000,385.000000,353.000000,...,129.000000,160.000000,204.000000,98.000000,100.000000,88.000000,77.000000,141.000000,171.000000,130.000000

In [88]:
#transpose
df_item_sales=df_sales.melt(id_vars=['id', 'item', 'category', 'department',
                                     'store', 'store_code', 'region'],
                                     var_name='d',
                                     value_name='sales')
df_item_sales.head()

,id,item,category,department,store,store_code,region,d,sales
0,ACCESORIES_1_001_NYC_1,ACCESORIES_1_001,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_1,0
1,ACCESORIES_1_002_NYC_1,ACCESORIES_1_002,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_1,0
2,ACCESORIES_1_003_NYC_1,ACCESORIES_1_003,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_1,0
3,ACCESORIES_1_004_NYC_1,ACCESORIES_1_004,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_1,0
4,ACCESORIES_1_005_NYC_1,ACCESORIES_1_005,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_1,0

In [89]:
df_item_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58327370 entries, 0 to 58327369
Data columns (total 9 columns):
 #   Column      Dtype
---  ------      -----
 0   id          object
 1   item        object
 2   category    object
 3   department  object
 4   store       object
 5   store_code  object
 6   region      object
 7   d           object
 8   sales       int64
dtypes: int64(1), object(8)
memory usage: 3.9+ GB

In [90]:
#Should I delete those reg where sales = 0
sales_0=df_item_sales[df_item_sales['sales']==0].value_counts().sum()/len(df_item_sales)
print(sales_0)

0.6819627560783214

In [ ]:
#store db

In [91]:
df_stores=df_item_sales[['store', 'store_code','region']].drop_duplicates()

In [92]:
df_stores.head()

                   store store_code    region
0      Greenwich_Village      NYC_1  New York
3049              Harlem      NYC_2  New York
6098             Tribeca      NYC_3  New York
9147            Brooklyn      NYC_4  New York
12196          South_End      BOS_1    Boston

In [93]:
df_stores.reset_index(drop=True, inplace=True)
df_stores.head()

               store store_code    region
0  Greenwich_Village      NYC_1  New York
1             Harlem      NYC_2  New York
2            Tribeca      NYC_3  New York
3           Brooklyn      NYC_4  New York
4          South_End      BOS_1    Boston

In [94]:
df_stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   store       10 non-null     object
 1   store_code  10 non-null     object
 2   region      10 non-null     object
dtypes: object(3)
memory usage: 372.0+ bytes

In [95]:
df_stores

               store store_code        region
0  Greenwich_Village      NYC_1      New York
1             Harlem      NYC_2      New York
2            Tribeca      NYC_3      New York
3           Brooklyn      NYC_4      New York
4          South_End      BOS_1        Boston
5            Roxbury      BOS_2        Boston
6           Back_Bay      BOS_3        Boston
7    Midtown_Village      PHI_1  Philadelphia
8           Yorktown      PHI_2  Philadelphia
9      Queen_Village      PHI_3  Philadelphia

In [96]:
df_category=df_item_sales[['category']].drop_duplicates()
df_category.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 1612
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   category  3 non-null      object
dtypes: object(1)
memory usage: 48.0+ bytes

In [97]:
df_category.reset_index(drop=True, inplace=True)
df_category

        category
0     ACCESORIES
1  HOME_&_GARDEN
2    SUPERMARKET

In [ ]:
#Item db

In [99]:
df_item=df_item_sales[['item', 'category']].drop_duplicates()
df_item.reset_index(drop=True, inplace=True)
df_item.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3049 entries, 0 to 3048
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   item      3049 non-null   object
 1   category  3049 non-null   object
dtypes: object(2)
memory usage: 47.8+ KB